In [1]:
import sqlite3

In [2]:
# Create connection
conn = sqlite3.connect('campany.db')
cursor = conn.cursor()

In [ ]:
#create my database

cursor.execute('''CREATE TABLE employees (
    emp_id INT PRIMARY KEY,
    name VARCHAR(50),
    last_name VARCHAR(50),
    salary DECIMAL(10, 2),
    manager_id INT,
    department_id INT
);''')

cursor.execute('''CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    name VARCHAR(50)
)''')

In [ ]:
#insert values to my first table 
cursor.executemany('INSERT INTO employees (name, last_name, salary,manager_id,department_id) VALUES ( ?, ?, ?, ?, ?)', [
('John', 'Doe', 3000, 101, 1),
('Jane', 'Smith', 2500, 102, 2),
('Alice', 'Johnson', 4000, 103, 3),
( 'Bob', 'Brown', 2000, 200, 4),
( 'Charlie', 'Davis', 5000, 101, 1),
( 'Emma', 'Wilson', 2200, 102, 3),
( 'Oliver', 'Taylor', 3200, 104, 2),
( 'Sophia', 'Martinez', 4500, 105, 4)
])

In [ ]:
#insert values to my first table 
cursor.executemany('INSERT INTO departments (name) VALUES (?)', [
    ('Human Resources',),
    ('Finance',),
    ('Engineering',),
    ('Marketing',)
])
#save
conn.commit()

Task 1: Using Comparison and Logical Operators 
Question: 
Write a SQL query to retrieve the emp_id, last_name, and salary of employees whose salary is 
between 2,000 and 5,000 and do not have a manager ID of 101 or 200. 
Instructions: 
1. Use the SELECT statement to specify the columns: emp_id, last_name, and salary. 
2. Filter the results using the WHERE clause with the BETWEEN operator to set the salary range. 
3. Use the NOT IN clause to exclude certain manager IDs. 
4. Combine conditions using the AND logical operator.

In [ ]:
cursor.execute('''SELECT emp_id, last_name, salary 
                FROM employees 
                WHERE salary BETWEEN 2000 AND 5000 AND manager_id NOT IN (101,200)''')
#display the data
print(cursor.fetchall())

[(2, 'Smith', 2500), (3, 'Johnson', 4000), (6, 'Wilson', 2200), (7, 'Taylor', 3200), (8, 'Martinez', 4500), (None, 'Smith', 2500), (None, 'Johnson', 4000), (None, 'Wilson', 2200), (None, 'Taylor', 3200), (None, 'Martinez', 4500)]

Task 2: Using JOINs and Aliases 
Question: 
Write a SQL query to display the employee names along with their respective department names. 
Use aliases for table names for better readability. 
Instructions: 
1. Use the SELECT statement to specify the columns: employee.name and department.name. 
2. Use the FROM clause to include the tables employees and departments. 
3. Use an INNER JOIN to connect the employees and departments tables based on the 
department IDs. 
4. Use table aliases (e.g., e for employees, d for departments) to shorten the table names in the 
query. 
5. Order the results by department name in ascending order.

In [39]:
cursor.execute('''SELECT emp.name ,dep.name
               FROM employees emp
               JOIN departments dep ON emp.department_id=dep.department_id
               group by emp.emp_id ''')
print(cursor.fetchall())

[('John', 'Human Resources'), ('John', 'Human Resources'), ('Jane', 'Finance'), ('Alice', 'Engineering'), ('Bob', 'Marketing'), ('Charlie', 'Human Resources'), ('Emma', 'Engineering'), ('Oliver', 'Finance'), ('Sophia', 'Marketing')]

Task 3: Aggregate Functions and GROUP BY 
Question: 
Write a SQL query to find the number of employees and the average salary for each department. 
Ensure that the results are grouped by department ID. 
Instructions: 
1. Use the SELECT statement to specify the department ID, the count of employees, and the 
average salary. 
2. Use the GROUP BY clause to group the results by department ID. 
3. Use the COUNT() function to find the number of employees in each department. 
4. Use the AVG() function to calculate the average salary in each department.

In [54]:
cursor.execute(''' SELECT emp.department_id,COUNT(emp_id) , AVG (salary),dep.name
                           FROM employees emp
                           JOIN departments dep ON  emp.department_id=dep.department_id
                           group by emp.department_id    ''')
print(cursor.fetchall())

[(1, 2, 4000.0, 'Human Resources'), (2, 2, 2850.0, 'Finance'), (3, 2, 3100.0, 'Engineering'), (4, 2, 3250.0, 'Marketing')]